{
    "version": "https://jsonfeed.org/version/1",
    "title": "Icicles of Thought • All posts by \"zsh\" tag",
    "description": "",
    "home_page_url": "https://lorefnon.me",
    "items": [
        {
            "id": "https://lorefnon.me/2014/09/13/commit-messages-from-generator-outputs.html",
            "url": "https://lorefnon.me/2014/09/13/commit-messages-from-generator-outputs.html",
            "title": "Commit messages from generator outputs",
            "date_published": "2014-09-13T00:00:00.000Z",
            "content_html": "<p>A practise I always follow while working with tools that generate code is that any code that is generated and not written by me is committed in isolation. This makes skimming through commit logs later easier because generators often generate many files upfront that wouldn&#39;t be edited until much later. So the subsequent commit wouldn&#39;t be littered with changes that aren&#39;t directly related to the actual operation mentioned in the commit message. Also while browsing through commit diffs keeping generated code in their own commits speeds up the reviewing process - because in most cases we already have an idea of what the generated could be, so it can be skipped.</p>\n<p>Now, if you use well designed frameworks with elegant command line interfaces, like Rails then the actual command typed along with the command output eg.</p>\n<pre><code>rails generate model post title:string body:text\n\ninvoke  active_record\ncreate    db/migrate/20140913191020_create_posts.rb\ncreate    app/models/post.rb\ninvoke    rspec\ncreate      spec/models/post_spec.rb\n</code></pre>\n<p>is expressive enough for a commit message. A person familiar enough with the framework can instantly see the above and know what happened there. In such case, spending time writing an explanatory commit message for a auto-generated code is pretty much a waste of time.</p>\n<p>So I have created a simple zsh function which does exactly the above:</p>\n<pre><code>GC ()\n&#123;\n  cmd=&quot;$@&quot;\n  output=$(&quot;$@&quot;)\n  git add .\n  git commit -m &quot;$cmd&quot; -m &quot;$output&quot;\n&#125;\n</code></pre>\n<p>Add it to your zshrc, and next time you can simply type :</p>\n<pre><code>GC rails g model comment body:text commenter:string\n</code></pre>\n<p>GC will add all the generated code (please ensure you have a clean state before running the generator - GC will not help you that) and committing it with the message as the command combined with the output of generator in separate paragraphs.</p>\n<pre><code>commit 029cb2e60187a196d918a08563d95775d73f5100\nAuthor: Lorefnon &lt;lorefnon@gmail.com&gt;\nDate:   Sun Sep 14 00:58:03 2014 +0530\n\n    rails g model comment body:text commenter:string\n\n          invoke  active_record\n          create    db/migrate/20140913192803_create_comments.rb\n          create    app/models/comment.rb\n          invoke    rspec\n          create      spec/models/comment_spec.rb\n</code></pre>\n",
            "tags": [
                "ZSH",
                "Productivity Hacks"
            ]
        }
    ]
}